tests/fixtures/billing_requests.json

{ 
  "list": {
    "method": "GET",
    "path_template": "/billing_requests",
    "url_params": {},
    "body": {"billing_requests":[{"created_at":"2015-01-01T12:00:00.000Z","id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 4425","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 1318","mandate_request":"MRQ123","mandate_request_mandate":"MD123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 4059"},"scheme":"bacs","verify":"always"},"metadata":{},"payment_request":{"amount":"1000","app_fee":"100","currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 2081"},"scheme":"bacs"},"status":"pending"},{"created_at":"2015-01-01T12:00:00.000Z","id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 8511","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 694","mandate_request":"MRQ123","mandate_request_mandate":"MD123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 456"},"scheme":"bacs","verify":"minimum"},"metadata":{},"payment_request":{"amount":"1000","app_fee":"100","currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 3300"},"scheme":"bacs"},"status":"pending"}],"meta":{"cursors":{"after":"example after 8162","before":"example before 5089"},"limit":50}}
  },
  "create": {
    "method": "POST",
    "path_template": "/billing_requests",
    "url_params": {},
    "body": {"billing_requests":{"actions":[{"bank_authorisation":{"adapter":"example adapter 4728","authorisation_type":"example authorisation_type 3274","requires_institution":false},"collect_customer_details":{"default_country_code":"example default_country_code 1445"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 495","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 5466","mandate_request":"MRQ123","mandate_request_mandate":"MD123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 8047"},"scheme":"bacs","verify":"when_available"},"metadata":{},"payment_request":{"amount":"1000","app_fee":"100","currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 1528"},"scheme":"bacs"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 9106"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 3237"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "get": {
    "method": "GET",
    "path_template": "/billing_requests/:identity",
    "url_params": {"identity": "BRQ123"},
    "body": {"billing_requests":{"actions":[{"bank_authorisation":{"adapter":"example adapter 5541","authorisation_type":"example authorisation_type 408","requires_institution":false},"collect_customer_details":{"default_country_code":"example default_country_code 6831"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 8287","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 9947","mandate_request":"MRQ123","mandate_request_mandate":"MD123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 2790"},"scheme":"bacs","verify":"always"},"metadata":{},"payment_request":{"amount":"1000","app_fee":"100","currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 2888"},"scheme":"bacs"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 5356"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 5429"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "collect_customer_details": {
    "method": "POST",
    "path_template": "/billing_requests/:identity/actions/collect_customer_details",
    "url_params": {"identity": "BRQ123"},
    "body": {"billing_requests":{"actions":[{"bank_authorisation":{"adapter":"example adapter 1737","authorisation_type":"example authorisation_type 631","requires_institution":true},"collect_customer_details":{"default_country_code":"example default_country_code 5026"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 563","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 5194","mandate_request":"MRQ123","mandate_request_mandate":"MD123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 4078"},"scheme":"bacs","verify":"always"},"metadata":{},"payment_request":{"amount":"1000","app_fee":"100","currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 2433"},"scheme":"bacs"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 3090"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 6413"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "collect_bank_account": {
    "method": "POST",
    "path_template": "/billing_requests/:identity/actions/collect_bank_account",
    "url_params": {"identity": "BRQ123"},
    "body": {"billing_requests":{"actions":[{"bank_authorisation":{"adapter":"example adapter 8705","authorisation_type":"example authorisation_type 2888","requires_institution":true},"collect_customer_details":{"default_country_code":"example default_country_code 3000"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 1353","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 1957","mandate_request":"MRQ123","mandate_request_mandate":"MD123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 2199"},"scheme":"bacs","verify":"recommended"},"metadata":{},"payment_request":{"amount":"1000","app_fee":"100","currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 3721"},"scheme":"bacs"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 6159"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 4324"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "fulfil": {
    "method": "POST",
    "path_template": "/billing_requests/:identity/actions/fulfil",
    "url_params": {"identity": "BRQ123"},
    "body": {"billing_requests":{"actions":[{"bank_authorisation":{"adapter":"example adapter 9355","authorisation_type":"example authorisation_type 2451","requires_institution":false},"collect_customer_details":{"default_country_code":"example default_country_code 8510"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 2605","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 156","mandate_request":"MRQ123","mandate_request_mandate":"MD123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 5561"},"scheme":"bacs","verify":"minimum"},"metadata":{},"payment_request":{"amount":"1000","app_fee":"100","currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 8266"},"scheme":"bacs"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 4783"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 7202"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "confirm_payer_details": {
    "method": "POST",
    "path_template": "/billing_requests/:identity/actions/confirm_payer_details",
    "url_params": {"identity": "BRQ123"},
    "body": {"billing_requests":{"actions":[{"bank_authorisation":{"adapter":"example adapter 1563","authorisation_type":"example authorisation_type 4376","requires_institution":true},"collect_customer_details":{"default_country_code":"example default_country_code 5746"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 5094","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 1577","mandate_request":"MRQ123","mandate_request_mandate":"MD123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 6420"},"scheme":"bacs","verify":"minimum"},"metadata":{},"payment_request":{"amount":"1000","app_fee":"100","currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 7463"},"scheme":"bacs"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 5447"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 9718"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "cancel": {
    "method": "POST",
    "path_template": "/billing_requests/:identity/actions/cancel",
    "url_params": {"identity": "BRQ123"},
    "body": {"billing_requests":{"actions":[{"bank_authorisation":{"adapter":"example adapter 8623","authorisation_type":"example authorisation_type 953","requires_institution":false},"collect_customer_details":{"default_country_code":"example default_country_code 3133"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 8878","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 2002","mandate_request":"MRQ123","mandate_request_mandate":"MD123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 8643"},"scheme":"bacs","verify":"always"},"metadata":{},"payment_request":{"amount":"1000","app_fee":"100","currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 3033"},"scheme":"bacs"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 9241"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 59"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  },
  "notify": {
    "method": "POST",
    "path_template": "/billing_requests/:identity/actions/notify",
    "url_params": {"identity": "BRQ123"},
    "body": {"billing_requests":{"actions":[{"bank_authorisation":{"adapter":"example adapter 6503","authorisation_type":"example authorisation_type 552","requires_institution":false},"collect_customer_details":{"default_country_code":"example default_country_code 2205"},"completes_actions":["collect_bank_account"],"required":true,"requires_actions":["collect_bank_account"],"status":"pending","type":"collect_bank_details"}],"created_at":"2015-01-01T12:00:00.000Z","id":"BRQ123","links":{"bank_authorisation":"example bank_authorisation 2546","creditor":"CR123","customer":"CU123","customer_bank_account":"BA123","customer_billing_detail":"example customer_billing_detail 9336","mandate_request":"MRQ123","mandate_request_mandate":"MD123","payment_request":"PRQ123","payment_request_payment":"PM123"},"mandate_request":{"currency":"GBP","links":{"mandate":"example mandate 1351"},"scheme":"bacs","verify":"recommended"},"metadata":{},"payment_request":{"amount":"1000","app_fee":"100","currency":"GBP","description":"Top-up Payment","links":{"payment":"example payment 1598"},"scheme":"bacs"},"resources":{"customer":{"company_name":"Hamilton Trading Ltd.","created_at":"2014-01-01T12:00:00.000Z","email":"user@example.com","family_name":"Osborne","given_name":"Frank","id":"CU123","language":"en","metadata":{},"phone_number":"+64 4 817 9999"},"customer_bank_account":{"account_holder_name":"Billie Jean","account_number_ending":"1234","account_type":"savings","bank_name":"BARCLAYS BANK PLC","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","currency":"EUR","enabled":true,"id":"BA123","links":{"customer":"example customer 7940"},"metadata":{}},"customer_billing_detail":{"address_line1":"221B Baker Street","address_line2":"Marylebone","address_line3":"City of Westminster","city":"London","country_code":"GB","created_at":"2014-01-01T12:00:00.000Z","danish_identity_number":"220550-6218","id":"CU123","ip_address":"127.0.0.1","postal_code":"NW1 6XE","region":"Greater London","schemes":["example schemes 9107"],"swedish_identity_number":"556564-5404"}},"status":"pending"}}
  }
}

